# GetCheckoutsComment

## Description
Get the comment that will be used for checkouts and commits.

```pascal
FUNCTION GetCheckoutsComment(VAR comment : STRING) : BOOLEAN;
```

```python

def vs.GetCheckoutsComment():
    return (BOOLEAN, comment)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|comment|STRING|The comment currently being used.|

## Returns
True on success, false on failure or not Project Sharing file.

## See Also
VS Functions:
SetCheckoutsComment

## Version
Availability: from Vectorworks 2016
## Category
* Project Sharing